Revit 2027 API
RevisionsOnSheetUIServiceData.IsReset Property
 flag to indicate the value has been reset
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsReset { get; set; }
Public Property IsReset As Boolean
	Get
	Set
public:
property bool IsReset {
	bool get ();
	void set (bool value);
}
member IsReset : bool with get, set
Property Value
Boolean
See Also
Reference
RevisionsOnSheetUIServiceData Class
Autodesk.Revit.UI Namespace